In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),index= [2, 'A', 4], columns=[48, 49, 50])

In [29]:
df

   48  49  50
2   1   2   3
A   4   5   6
4   7   8   9

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 2 to 4
Data columns (total 3 columns):
48    3 non-null int64
49    3 non-null int64
50    3 non-null int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [31]:
df.describe()

        48   49   50
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

# criando uma coluna nova

In [32]:
df['tipo-de-alerta']=0

In [34]:
df['tipo-de-alerta']=df[48]+df[49]

In [36]:
df[48].mean()

4.0

In [39]:
df['tipo-de-alerta2']=df[48].add(2)

In [40]:
df

   48  49  50  tipo-de-alerta  tipo-de-alerta2
2   1   2   3               3                3
A   4   5   6               9                6
4   7   8   9              15                9

# criando series a partir de dicion√°rios

In [43]:
d = {'Chicago': 1000, 'New York': 1300, 'Portland': 900, 'San Francisco': 1100,
     'Austin': 450, 'Boston': None}
print(type(d))
cities = pd.Series(d)
cities
print(type(cities))

<class 'dict'>
<class 'pandas.core.series.Series'>

# agregando um series a um dataframe

In [47]:
dfc = pd.DataFrame()
dfc['cidades']=cities

In [57]:
dfc['alerta']=dfc['cidades'].mean()
dfc['alerta2']=dfc['cidades'] + dfc['alerta']
dfc['alerta3']=dfc['alerta2'].sum()
dfc

               cidades  alerta  alerta2  alerta3
Chicago         1000.0   950.0   1950.0   9500.0
New York        1300.0   950.0   2250.0   9500.0
Portland         900.0   950.0   1850.0   9500.0
San Francisco   1100.0   950.0   2050.0   9500.0
Austin           450.0   950.0   1400.0   9500.0
Boston             NaN   950.0      NaN   9500.0

In [4]:
cities[cities < 1000]

Portland    900.0
Austin      450.0
dtype: float64

# implementando um fitro

In [5]:
less_than_1000 = cities < 1000
print(less_than_1000)
print('\n')
print(cities[less_than_1000])

Chicago          False
New York         False
Portland          True
San Francisco    False
Austin            True
Boston           False
dtype: bool


Portland    900.0
Austin      450.0
dtype: float64

# Identificando nulos

In [50]:
print(cities)

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64

In [51]:
print(cities.notnull())

Chicago           True
New York          True
Portland          True
San Francisco     True
Austin            True
Boston           False
dtype: bool

In [52]:
print(cities.isnull())

Chicago          False
New York         False
Portland         False
San Francisco    False
Austin           False
Boston            True
dtype: bool

In [53]:
print(cities[cities.isnull()])

Boston   NaN
dtype: float64

In [54]:
print(cities[cities.notnull()])

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
dtype: float64

In [69]:
citiesNN=cities.dropna()

In [70]:
print(citiesNN)

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
dtype: float64

In [71]:
citiesFN=cities.fillna(0)

In [72]:
print(citiesFN)

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              0.0
dtype: float64

In [74]:
citiesFN=cities.fillna(cities.mean())

In [75]:
print(citiesFN)

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston            950.0
dtype: float64

In [73]:
print(cities)
cities.notnull()

print(cities.isnull())
#print('\n')
print(cities[cities.isnull()])

Chicago          1000.0
New York         1300.0
Portland          900.0
San Francisco    1100.0
Austin            450.0
Boston              NaN
dtype: float64
Chicago          False
New York         False
Portland         False
San Francisco    False
Austin           False
Boston            True
dtype: bool
Boston   NaN
dtype: float64

In [ ]:
# criando dataframe com none

In [59]:
df = pd.DataFrame(data=np.array([[1, 2, 3], [4, 5, 6], [7, 8, None]]),index= [2, 'A', 4], columns=[48, 49, 50])

In [60]:
df

  48 49    50
2  1  2     3
A  4  5     6
4  7  8  None

In [68]:
df.describe()

        48   49
count  3.0  3.0
mean   4.0  5.0
std    3.0  3.0
min    1.0  2.0
25%    2.5  3.5
50%    4.0  5.0
75%    5.5  6.5
max    7.0  8.0

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 2 to 4
Data columns (total 3 columns):
48    3 non-null int64
49    3 non-null object
50    2 non-null object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [ ]:
#transformando para int

In [67]:
df[48]=df[48].astype(int)
df[49]=df[49].astype(int)
#df[50]=df[50].astype(int)

In [ ]:
#indice multivalorado

In [76]:
index = [('California', 2000), ('California', 2010),('New York', 2000), ('New York', 2010),('Texas', 2000), ('Texas', 2010)]

In [77]:
populations = [33871648, 37253956,18976457, 19378102,20851820, 25145561]
pop = pd.Series(populations, index=index)

In [78]:
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [79]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [83]:
pop = pop.reindex(index)
print(pop)
pop[:, 2010]

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

ValueError: Can only tuple-index with a MultiIndex

# Abrindo dataframe a partir de uma URL

In [11]:
url = 'https://raw.github.com/gjreda/best-sandwiches/master/data/best-sandwiches-geocode.tsv'

from_url = pd.read_table(url, sep='\t')
from_url.head()

,rank,sandwich,restaurant,description,price,address,city,phone,website,full_address,formatted_address,lat,lng
0,1,BLT,Old Oak Tap,The B is applewood smoked&mdash;nice and snapp...,$10,2109 W. Chicago Ave.,Chicago,773-772-0406,theoldoaktap.com,"2109 W. Chicago Ave., Chicago","2109 West Chicago Avenue, Chicago, IL 60622, USA",41.895734,-87.679960
1,2,Fried Bologna,Au Cheval,Thought your bologna-eating days had retired w...,$9,800 W. Randolph St.,Chicago,312-929-4580,aucheval.tumblr.com,"800 W. Randolph St., Chicago","800 West Randolph Street, Chicago, IL 60607, USA",41.884672,-87.647754
2,3,Woodland Mushroom,Xoco,Leave it to Rick Bayless and crew to come up w...,$9.50.,445 N. Clark St.,Chicago,312-334-3688,rickbayless.com,"445 N. Clark St., Chicago","445 North Clark Street, Chicago, IL 60654, USA",41.890602,-87.630925
3,4,Roast Beef,Al&rsquo;s Deli,"The Francophile brothers behind this deli, whi...",$9.40.,914 Noyes St.,Evanston,NaN,alsdeli.net,"914 Noyes St., Evanston","914 Noyes Street, Evanston, IL 60201, USA",42.058442,-87.684425
4,5,PB&amp;L,Publican Qualty Meats,"When this place opened in February, it quickly...",$10,825 W. Fulton Mkt.,Chicago,312-445-8977,publicanqualitymeats.com,"825 W. Fulton Mkt., Chicago","825 West Fulton Market, Chicago, IL 60607, USA",41.886637,-87.648553

In [ ]:
# acessando dados de um bd com pandas

In [84]:
import sqlite3

cnx = sqlite3.connect('/home/silvio/survey.db')

# montando um dataframe a partir de uma consulta SQL

In [19]:
df = pd.read_sql_query("select * from person", cnx)
df

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [85]:
df = pd.read_sql_query("select * from site", cnx)
df

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40
3    DD1   1.00    2.00

In [86]:
df = pd.read_sql_query("select * from visited", cnx)
df

    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22
8  999   DDF3

In [87]:
df = pd.read_sql_query("select * from survey", cnx)
df

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735   None   sal     0.06
9     735   None  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [21]:
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [24]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); 
print(df6); 
print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

/opt/miniconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """